# ----------------------------------- https://github.com/m4mallu/clonebot --------------------------------------------#
class Presets(object):
    WELCOME_TEXT = "⭑⭑⭑★✪ HELP for more info: ✪★⭑⭑"
    HELP_TEXT = """𝙃𝙚𝙡𝙡𝙤..\n\n
▞▞▞ 🆆🅷🅾 🅰🅼 🅸 ▞▞▞

𝙄'𝙢 👉 <b>{}</b> 👈

🌀 𝙄 𝙘𝙖𝙣 𝙘𝙡𝙤𝙣𝙚 𝙖𝙣𝙮𝙩𝙝𝙞𝙣𝙜, 𝙛𝙧𝙤𝙢 𝙖𝙣𝙮𝙬𝙝𝙚𝙧𝙚 𝙩𝙤 𝙮𝙤𝙪𝙧 𝙥𝙚𝙧𝙨𝙤𝙣𝙖𝙡 𝙘𝙝𝙖𝙩 🏂

🌀 𝙄𝙛 𝙞𝙩'𝙨 𝙖 𝙥𝙧𝙞𝙫𝙖𝙩𝙚 𝙤𝙧 𝙥𝙪𝙗𝙡𝙞𝙘 𝙘𝙝𝙖𝙩, 𝙞 𝙙𝙤𝙣'𝙩 𝙘𝙖𝙧𝙚 🧘‍♂️


▞▞▞ 🅷🅸🅶🅷🅻🅸🅶🅷🆃🆂 ▞▞▞

🌀 𝙎𝙩𝙧𝙞𝙣𝙜 𝙨𝙚𝙨𝙨𝙞𝙤𝙣 𝙪𝙨𝙚𝙧 𝙣𝙚𝙚𝙙 𝙩𝙤 𝙗𝙚 𝙖 𝙢𝙚𝙢𝙗𝙚𝙧 𝙤𝙛 𝙩𝙝𝙚 𝙎𝙤𝙪𝙧𝙘𝙚 𝙘𝙝𝙖𝙩 𝙖𝙣𝙙 𝙖𝙙𝙢𝙞𝙣 𝙩𝙤 𝙗𝙚 𝙩𝙝𝙚 𝘿𝙚𝙨𝙩𝙞𝙣𝙖𝙩𝙞𝙤𝙣 𝙘𝙝𝙖𝙩

🌀 𝘽𝙤𝙩 𝙙𝙤𝙚𝙨𝙣'𝙩 𝙣𝙚𝙚𝙙 𝙩𝙤 𝙗𝙚 𝙖 𝙢𝙚𝙢𝙗𝙚𝙧 / 𝙖𝙙𝙢𝙞𝙣 𝙤𝙛 𝙗𝙤𝙩𝙝 𝙎𝙤𝙪𝙧𝙘𝙚 & 𝘿𝙚𝙨𝙩𝙞𝙣𝙖𝙩𝙞𝙤𝙣 𝘾𝙝𝙖𝙩𝙨

▞▞▞ 🅿🆁🅾🅲🅴🅳🆄🆁🅴 ▞▞▞
➡️ 𝐉𝐨𝐢𝐧 𝐭𝐡𝐞 𝐬𝐨𝐮𝐫𝐜𝐞 𝐜𝐡𝐚𝐭 𝐚𝐬 𝐚 𝐦𝐞𝐦𝐛𝐞𝐫
➡️ 𝐉𝐨𝐢𝐧 𝐭𝐡𝐞 𝐝𝐞𝐬𝐭𝐢𝐧𝐚𝐭𝐢𝐨𝐧 𝐜𝐡𝐚𝐭 𝐚𝐬 𝐚𝐝𝐦𝐢𝐧
➡️ 𝐁𝐨𝐭 𝐝𝐨𝐞𝐬𝐧'𝐭 𝐧𝐞𝐞𝐝 𝐭𝐨 𝐛𝐞 𝐢𝐧 𝐛𝐨𝐭𝐡 𝐜𝐡𝐚𝐭𝐬.
➡️ 𝐒𝐭𝐚𝐫𝐭 𝐭𝐡𝐞 𝐛𝐨𝐭
➡️ 𝐈𝐧𝐩𝐮𝐭 𝐒𝐨𝐮𝐫𝐜𝐞 & 𝐃𝐞𝐬𝐭𝐢𝐧𝐚𝐭𝐢𝐨𝐧 𝐜𝐡𝐚𝐭𝐬
➡️ 𝐑𝐮𝐧 𝐂𝐥𝐨𝐧𝐞
  
𝑀𝓎 𝓇𝑒𝓅𝑜 𝒸𝒶𝓃 𝒷𝑒 𝓈𝑒𝑒 (⦿‿⦿) <a href='https://github.com/m4mallu/clonebot'>𝙃𝙚𝙧𝙚</a>
    """
    MESSAGE_COUNT = "𝗬𝗼𝘂'𝘃𝗲 𝗰𝗼𝗽𝗶𝗲𝗱 : \n\n📚 𝐃𝐨𝐜𝐮𝐦𝐞𝐧𝐭𝐬 <b>  : {}</b>\n🎞 𝐕𝐢𝐝𝐞𝐨𝐬         <b>  : {}</b>\n" \
                    "🔊 𝐀𝐮𝐝𝐢𝐨𝐬         <b>  : {}</b>\n\n⏳ 𝐓𝐢𝐦𝐞 𝐓𝐚𝐤𝐞𝐧  <b>          : {}</b>\n🆙 𝐁𝐨𝐭 𝐔𝐩𝐭𝐢𝐦𝐞" \
                    "  <b>           : {}</b>\n\n📲 𝐂𝐥𝐨𝐧𝐞 𝐒𝐭𝐚𝐫𝐭𝐞𝐝 𝐀𝐭  <b>  : {}</b>\n📌 𝐋𝐚𝐬𝐭 𝐔𝐩𝐝𝐚𝐭𝐞𝐝 𝐎𝐧  <b>" \
                    " : {}</b>"
    COPYING_MESSAGES = "<b>Copying Medias...</b>"
    IN_CORRECT_PERMISSIONS_MESSAGE_SOURCE = "A̶c̶c̶e̶s̶s̶ ̶D̶e̶n̶i̶e̶d̶\n\n𝙎𝙩𝙧𝙞𝙣𝙜 𝙨𝙚𝙨𝙨𝙞𝙤𝙣 𝙪𝙨𝙚𝙧 𝙞𝙨 𝙣𝙤𝙩 𝙖 𝙢𝙚𝙢𝙗𝙚𝙧 𝙤𝙛 𝙩𝙝𝙚 𝙨𝙤𝙪𝙧𝙘𝙚 𝙘𝙝𝙖𝙩 𝙜𝙞𝙫𝙚𝙣. " \
                                            "𝙅𝙤𝙞𝙣 𝙩𝙝𝙚 𝙨𝙤𝙪𝙧𝙘𝙚 𝙘𝙝𝙖𝙩 𝙖𝙣𝙙 𝙩𝙧𝙮 𝙖𝙜𝙖𝙞𝙣 𝙡𝙖𝙩𝙚𝙧"
    COPIED_MESSAGES = "<b><a href='https://github.com/m4mallu/clonebot'>Medias Copied</a></b>"
    FILE_TYPES = ["document", "video", "audio"]
    IN_CORRECT_PERMISSIONS_MESSAGE_DEST_ADMIN = "A̶c̶c̶e̶s̶s̶ ̶D̶e̶n̶i̶e̶d̶\n\n𝙎𝙩𝙧𝙞𝙣𝙜 𝙨𝙚𝙨𝙨𝙞𝙤𝙣 𝙪𝙨𝙚𝙧 𝙞𝙨 𝙣𝙤𝙩 𝙖𝙣 𝙖𝙙𝙢𝙞𝙣 " \
                                                "𝙞𝙣 𝙩𝙝𝙚 𝙙𝙚𝙨𝙩𝙞𝙣𝙖𝙩𝙞𝙤𝙣 𝙘𝙝𝙖𝙩 𝙜𝙞𝙫𝙚𝙣."
    IN_CORRECT_PERMISSIONS_MESSAGE_DEST_POSTING = "A̶c̶c̶e̶s̶s̶ ̶D̶e̶n̶i̶e̶d̶\n\n𝙎𝙩𝙧𝙞𝙣𝙜 𝙨𝙚𝙨𝙨𝙞𝙤𝙣 𝙪𝙨𝙚𝙧 𝙙𝙤𝙚𝙨𝙣'𝙩 𝙝𝙖𝙫𝙚 𝙥𝙤𝙨𝙩𝙞𝙣𝙜 𝙥𝙧𝙞𝙫𝙞𝙡𝙚𝙜𝙚𝙨 " \
                                                  "𝙞𝙣 𝙩𝙝𝙚 𝙙𝙚𝙨𝙩𝙞𝙣𝙖𝙩𝙞𝙤𝙣 𝙘𝙝𝙖𝙩 𝙜𝙞𝙫𝙚𝙣"
    CANCEL_CLONE = "𝙎𝙩𝙤𝙥𝙥𝙞𝙣𝙜 𝙩𝙝𝙚 𝙥𝙧𝙤𝙘𝙚𝙨𝙨... 𝙋𝙡𝙯 𝙬𝙖𝙞𝙩 🕚"
    CANCELLED_MSG = "𝘾𝙡𝙤𝙣𝙞𝙣𝙜 𝙘𝙖𝙣𝙘𝙚𝙡𝙡𝙚𝙙 𝙨𝙪𝙘𝙘𝙚𝙨𝙨𝙛𝙪𝙡𝙡𝙮 ✅"
    INITIAL_MESSAGE_TEXT = "🔎 𝐋𝐨𝐨𝐤𝐢𝐧𝐠 𝐟𝐨𝐫 𝐌𝐞𝐝𝐢𝐚𝐬 🔎"
    WAIT_MSG = "𝐏𝐥𝐞𝐚𝐬𝐞, 𝐰𝐚𝐢𝐭...\n𝘾𝙤𝙣𝙛𝙞𝙧𝙢𝙞𝙣𝙜 𝙪𝙨𝙚𝙧 𝙧𝙞𝙜𝙝𝙩𝙨.."
    CLOSE_BTN_TXT = "<code>Be patient, You will get a\nmsg when finished.If you wish\n" \
                    "to cancel, tap the button</code>"
    SOURCE_CONFIRM = "𝐒𝐨𝐮𝐫𝐜𝐞 𝐜𝐡𝐚𝐭 𝐈𝐝 👉 <code> {}</code>\n\n𝐒𝐚𝐯𝐞𝐝 𝐬𝐮𝐜𝐜𝐞𝐬𝐬𝐟𝐮𝐥𝐥𝐲 ✅"
    DESTINATION_CONFIRM = "𝐓𝐚𝐫𝐠𝐞𝐭 𝐜𝐡𝐚𝐭 𝐈𝐝 👉 <code> {}</code>\n\n𝐒𝐚𝐯𝐞𝐝 𝐬𝐮𝐜𝐜𝐞𝐬𝐬𝐟𝐮𝐥𝐥𝐲 ✅"
    VIEW_CONF = "⚙️ 𝐘𝐨𝐮𝐫 𝐜𝐡𝐚𝐭 𝐜𝐨𝐧𝐟𝐢𝐠𝐮𝐫𝐚𝐭𝐢𝐨𝐧𝐬 ⚙️\n\n🍾 𝐒𝐨𝐮𝐫𝐜𝐞 𝐈𝐝         : <code>{}</code>\n🎯 𝐃𝐞𝐬𝐭𝐢𝐧𝐚𝐭𝐢𝐨𝐧 𝐈𝐝 : " \
                "<code>{}</code>"
    NOT_CONFIGURED = "𝙉𝙤 𝙘𝙝𝙖𝙩 𝙘𝙤𝙣𝙛𝙞𝙜𝙪𝙧𝙖𝙩𝙞𝙤𝙣 𝙛𝙤𝙪𝙣𝙙 ⚠"
    NOT_CONFIGURED_CLONE = "𝙉𝙤 𝙘𝙝𝙖𝙩 𝙘𝙤𝙣𝙛𝙞𝙜𝙪𝙧𝙖𝙩𝙞𝙤𝙣 𝙛𝙤𝙪𝙣𝙙 ⚠\n\n𝘾𝙤𝙣𝙛𝙞𝙜𝙪𝙧𝙚 𝙩𝙝𝙚 𝙎𝙤𝙪𝙧𝙘𝙚 & 𝘿𝙚𝙨𝙩𝙞𝙣𝙖𝙩𝙞𝙤𝙣 𝙘𝙝𝙖𝙩𝙨 𝙗𝙚𝙛𝙤𝙧𝙚 𝙮𝙤𝙪 𝙘𝙡𝙤𝙣𝙚 🤷"
    FINISHED_TEXT = "𝐂𝐨𝐧𝐠𝐫𝐚𝐭𝐮𝐥𝐚𝐭𝐢𝐨𝐧𝐬 🥂\n\n𝐌𝐞𝐝𝐢𝐚𝐬 𝐜𝐥𝐨𝐧𝐞𝐝 𝐬𝐮𝐜𝐜𝐞𝐬𝐬𝐟𝐮𝐥𝐥𝐲 ✅"
    INVALID_CHAT_ID = "𝐈𝐧𝐯𝐚𝐥𝐢𝐝 𝐜𝐡𝐚𝐭 𝐩𝐚𝐫𝐚𝐦𝐞𝐭𝐞𝐫 𝐟𝐨𝐮𝐧𝐝 🤷"
    CLEAR_CONFIG = "𝙊𝙠 ! 𝘿𝙤𝙣𝙚.. 👍\n\n𝙎𝙩𝙤𝙧𝙚𝙙 𝙘𝙝𝙖𝙩 𝙘𝙤𝙣𝙛𝙞𝙜 𝙘𝙡𝙚𝙖𝙧𝙚𝙙 ❗"
    ASK_SOURCE = "𝙂𝙞𝙫𝙚 𝙩𝙝𝙚 𝙨𝙤𝙪𝙧𝙘𝙚 𝙘𝙝𝙖𝙩 𝙄𝙙:\n𝑌𝑜𝑢 ℎ𝑎𝑣𝑒 30𝑆𝑒𝑐 𝑡𝑜 𝑑𝑜 𝑡ℎ𝑖𝑠.."
    ASK_DESTINATION = "𝙂𝙞𝙫𝙚 𝙩𝙝𝙚 𝘿𝙚𝙨𝙩𝙞𝙣𝙖𝙩𝙞𝙤𝙣 𝙘𝙝𝙖𝙩 𝙄𝙙:\n𝑌𝑜𝑢 ℎ𝑎𝑣𝑒 30𝑆𝑒𝑐 𝑡𝑜 𝑑𝑜 𝑡ℎ𝑖𝑠.."
    CHAT_DUPLICATED_MSG = "𝙎𝙤𝙪𝙧𝙘𝙚 & 𝘿𝙚𝙨𝙩𝙞𝙣𝙖𝙩𝙞𝙤𝙣 𝙘𝙝𝙖𝙩 𝙄𝙙𝙨 𝙘𝙖𝙣'𝙩 𝙗𝙚 𝙨𝙖𝙢𝙚 "
